# Data Load into postgreSQL database

In [1]:
# Import Dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Read in water CSV files to be loaded to database
water_csv = "water.csv"
water = pd.read_csv(water_csv)
water.head()

  country  year  accessibility_percentage
0     AFG  2017                  67.06462
1     ALB  2017                  91.03923
2     DZA  2017                  93.55589
3     AND  2017                 100.00000
4     AGO  2017                  55.84290

In [3]:
# Read in mortality CSV files to be loaded to database
mortalities_csv = "mortalities.csv"
mortalities = pd.read_csv(mortalities_csv)
mortalities.head()

  country  year gender  mortality_rate
0     AFG  2017   BTSX        64.94076
1     AGO  2017   BTSX        80.62230
2     ALB  2017   BTSX         9.41805
3     AND  2017   BTSX         3.21892
4     ARE  2017   BTSX         7.69530

In [4]:
combined_df = pd.merge(water, mortalities)
combined_df

    country  year  accessibility_percentage gender  mortality_rate
0       AFG  2017                  67.06462   BTSX        64.94076
1       ALB  2017                  91.03923   BTSX         9.41805
2       DZA  2017                  93.55589   BTSX        24.31948
3       AND  2017                 100.00000   BTSX         3.21892
4       AGO  2017                  55.84290   BTSX        80.62230
..      ...   ...                       ...    ...             ...
187     VEN  2017                  95.72371   BTSX        24.20000
188     VNM  2017                  94.71880   BTSX        20.84312
189     YEM  2017                  63.47347   BTSX        56.96643
190     ZMB  2017                  59.96376   BTSX        64.33790
191     ZWE  2017                  64.05123   BTSX        58.23492

[192 rows x 5 columns]

In [5]:
# filter dataframe to specific columns
combined_df1 = combined_df[['country', 'year', 'accessibility_percentage', 'mortality_rate']].copy()
combined_df1.head()

  country  year  accessibility_percentage  mortality_rate
0     AFG  2017                  67.06462        64.94076
1     ALB  2017                  91.03923         9.41805
2     DZA  2017                  93.55589        24.31948
3     AND  2017                 100.00000         3.21892
4     AGO  2017                  55.84290        80.62230

In [6]:
# connect to database
connection_string = "postgres:[{PASSWORD}@localhost:5432/Water_Mortalities"
engine = create_engine(f'postgresql://{connection_string}')

In [7]:
# confirm tables
engine.table_names()

['water', 'mortalities', 'combined']

 # Load dataframes into database

In [8]:
# use pandas to load dataframes to database
water.to_sql(name='water', con=engine, if_exists='append', index=False)
mortalities.to_sql(name='mortalities', con=engine, if_exists='append', index=False)

In [9]:
combined_df1.to_sql(name="combined", con=engine, if_exists="append", index=False)

In [10]:
# Check that dataframes have loaded successfully
pd.read_sql_query('select * from water', con=engine).head()

   id country  year  accessibility_percentage
0   1     AFG  2017                  67.06462
1   2     ALB  2017                  91.03923
2   3     DZA  2017                  93.55589
3   4     AND  2017                 100.00000
4   5     AGO  2017                  55.84290

In [11]:
# Check that dataframes have loaded successfully
pd.read_sql_query('select * from mortalities', con=engine).head()

   id country  year gender  mortality_rate
0   1     AFG  2017   BTSX        64.94076
1   2     AGO  2017   BTSX        80.62230
2   3     ALB  2017   BTSX         9.41805
3   4     AND  2017   BTSX         3.21892
4   5     ARE  2017   BTSX         7.69530

In [12]:
# Check that dataframes have loaded successfully
pd.read_sql_query('select * from combined', con=engine).head()

   id country  year  accessibility_percentage  mortality_rate
0   1     AFG  2017                  67.06462        64.94076
1   2     ALB  2017                  91.03923         9.41805
2   3     DZA  2017                  93.55589        24.31948
3   4     AND  2017                 100.00000         3.21892
4   5     AGO  2017                  55.84290        80.62230